# Install more recent versions of some macOS tools.
brew 'grep'
brew 'python'
brew 'screen'
brew 'vim', args: ['override-system-vi']

# git + lfs
brew 'git'
brew 'git-lfs'
brew 'hub'

# language support and tools
brew 'chruby'
brew 'elixir'
brew 'go'
brew 'node'
brew 'python@2'
brew 'ruby-install'

# build tools
brew 'automake'
brew 'bazel'
brew 'buck'
brew 'chisel'
brew 'cmake'
brew 'libtool' # glibtool
brew 'ninja'
brew 'yarn'

# general dev tools
brew 'pow' # pow.cx
brew 'jenv'

# https://github.com/jgavris/rs-git-fsmonitor
# https://blog.github.com/2018-04-05-git-217-released/#speeding-up-status-with-watchman
tap 'jgavris/rs-git-fsmonitor', 'https://github.com/jgavris/rs-git-fsmonitor.git'
brew 'rs-git-fsmonitor'

# a/v
brew 'ffmpeg', args: ['with-fdk-aac', 'with-x265']
brew 'imagemagick', args: ['with-ghostscript']
brew 'youtube-dl'

# install other useful binaries and tools
brew 'colordiff'
brew 'dark-mode'
brew 'gnupg'
brew 'grc'
brew 'jq'
brew 'man2html'
brew 'moreutils'
brew 'ngrep'
brew 'nmap'
brew 'rename'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'trash'
brew 'tree'
brew 'vbindiff'
brew 'watch'
brew 'wget', args: ['enable-iri']
brew 'zopfli'

# casks for quicklook plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklookapk'
cask 'suspicious-package'
