# Install more recent versions of some macOS tools.
brew 'grep'
brew 'screen'
brew 'vim', args: ['override-system-vi']

# git + lfs
brew 'git'
brew 'git-lfs'
brew 'hub'

# language support and tools
brew 'chruby'
brew 'go'
brew 'node'
brew 'pyenv'
brew 'python'
brew 'ruby-install'

# dev tools
brew 'automake'
brew 'bat'
brew 'bazelisk'
brew 'buildifier'
brew 'chisel'
brew 'cmake'
brew 'jenv'
brew 'libtool' # glibtool
brew 'maven'
brew 'ninja'
brew 'shellcheck'
brew 'swiftformat'
brew 'swiftlint'
brew 'xcbeautify'
brew 'xcodegen'
brew 'yarn'

# a/v
# brew 'ffmpeg', args: ['with-fdk-aac', 'with-x265']
# brew 'imagemagick', args: ['with-ghostscript']
# brew 'youtube-dl'

# install other useful binaries and tools
brew 'asciinema'
brew 'colordiff'
brew 'cowsay'
brew 'dark-mode'
brew 'diskus'
brew 'fd'
brew 'fzf'
brew 'gnupg'
brew 'grc'
brew 'hexyl'
brew 'hyperfine'
brew 'jq'
brew 'moreutils'
brew 'ngrep'
brew 'nmap'
brew 'pngcrush'
brew 'rename'
brew 'ripgrep'
brew 'switchaudio-osx'
brew 'trash'
brew 'tree'
brew 'vbindiff'
brew 'watch'
brew 'wget'
brew 'yq'
