# Ruby environment
brew 'chruby'
brew 'ruby-install'

# Install more recent versions of some macOS tools.
brew 'grep'
brew 'python'
brew 'screen'
brew 'vim', args: ['override-system-vi']

# git + lfs
brew 'git'
brew 'git-lfs'

# install other useful binaries
brew 'chisel'
brew 'gnupg'
brew 'go'
brew 'hub'
brew 'jq'
brew 'moreutils'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'rename'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'trash'
brew 'tree'
brew 'vbindiff'
brew 'wget', args: ['enable-iri']
brew 'youtube-dl'
brew 'zopfli'
